spec/fixtures/soap/xml/IControl/LocalLB/VirtualServer/IControl.LocalLB.VirtualServer.create_b5d0f221279b226862c75aeea5d9cb76_request.xml

<?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="urn:iControl:LocalLB/VirtualServer"><env:Body><wsdl:create><definitions><item><name>to_be_deleted_test_virtual_server</name><address>192.168.145.7</address><port>79</port><protocol>PROTOCOL_TCP</protocol></item></definitions><wildmasks><item>255.255.255.255</item></wildmasks><resources><item><type>IControl::LocalLB::VirtualServer::VirtualServerType::RESOURCE_TYPE_POOL</type><default_pool_name>pool_test1</default_pool_name></item></resources><profiles><item><item1><profile_context>IControl::LocalLB::ProfileContextType::PROFILE_CONTEXT_TYPE_ALL</profile_context><profile_name>tcp</profile_name></item1></item></profiles></wsdl:create></env:Body></env:Envelope>